# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. 
# m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

a_list = [1, 2, 3, 4, 1, 2, 3, 1, 1, 13, 3,
          4, 5, 53, 6, 7, 74, 45, 3, 23, 5, 435, 7]
a_list = set(a_list)
print(int(a_list))
